### Fuel Economy Data

https://pandas.pydata.org/pandas-docs/stable/10min.html

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

/home/faisal/anaconda3/lib/python3.6/site-packages/matplotlib/font_manager.py:279: UserWarning: Matplotlib is building the font cache using fc-list. This may take a moment.
  'Matplotlib is building the font cache using fc-list. '

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01  1.604358  0.758764 -0.901469  0.804977
2013-01-02 -0.200685  0.300855 -1.017939  0.260852
2013-01-03 -0.566954 -0.662751  0.177715 -1.611889
2013-01-04  0.611497  1.120375  0.244885  0.821416
2013-01-05 -0.097501  0.116107  0.912280 -0.721272
2013-01-06  0.469433 -0.935408  0.080791  0.322760

In [9]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D' : np.array([3] * 4, dtype='int32'),
                    'E' : pd.Categorical(["test", "train", "test", "train"]),
                    'F' : 'foo'
                   })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
df.head()

                   A         B         C         D
2013-01-01  1.604358  0.758764 -0.901469  0.804977
2013-01-02 -0.200685  0.300855 -1.017939  0.260852
2013-01-03 -0.566954 -0.662751  0.177715 -1.611889
2013-01-04  0.611497  1.120375  0.244885  0.821416
2013-01-05 -0.097501  0.116107  0.912280 -0.721272

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.611497  1.120375  0.244885  0.821416
2013-01-05 -0.097501  0.116107  0.912280 -0.721272
2013-01-06  0.469433 -0.935408  0.080791  0.322760

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.303358  0.116324 -0.083956 -0.020526
std    0.772958  0.795990  0.739850  0.960294
min   -0.566954 -0.935408 -1.017939 -1.611889
25%   -0.174889 -0.468037 -0.655904 -0.475741
50%    0.185966  0.208481  0.129253  0.291806
75%    0.575981  0.644287  0.228093  0.684423
max    1.604358  1.120375  0.912280  0.821416

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.604358   -0.200685   -0.566954    0.611497   -0.097501    0.469433
B    0.758764    0.300855   -0.662751    1.120375    0.116107   -0.935408
C   -0.901469   -1.017939    0.177715    0.244885    0.912280    0.080791
D    0.804977    0.260852   -1.611889    0.821416   -0.721272    0.322760

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.804977 -0.901469  0.758764  1.604358
2013-01-02  0.260852 -1.017939  0.300855 -0.200685
2013-01-03 -1.611889  0.177715 -0.662751 -0.566954
2013-01-04  0.821416  0.244885  1.120375  0.611497
2013-01-05 -0.721272  0.912280  0.116107 -0.097501
2013-01-06  0.322760  0.080791 -0.935408  0.469433

In [16]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06  0.469433 -0.935408  0.080791  0.322760
2013-01-03 -0.566954 -0.662751  0.177715 -1.611889
2013-01-05 -0.097501  0.116107  0.912280 -0.721272
2013-01-02 -0.200685  0.300855 -1.017939  0.260852
2013-01-01  1.604358  0.758764 -0.901469  0.804977
2013-01-04  0.611497  1.120375  0.244885  0.821416

In [17]:
df['A']

2013-01-01    1.604358
2013-01-02   -0.200685
2013-01-03   -0.566954
2013-01-04    0.611497
2013-01-05   -0.097501
2013-01-06    0.469433
Freq: D, Name: A, dtype: float64

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01  1.604358  0.758764 -0.901469  0.804977
2013-01-02 -0.200685  0.300855 -1.017939  0.260852
2013-01-03 -0.566954 -0.662751  0.177715 -1.611889

In [19]:
df.loc[dates[0]]

A    1.604358
B    0.758764
C   -0.901469
D    0.804977
Name: 2013-01-01 00:00:00, dtype: float64

In [20]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  1.604358  0.758764
2013-01-02 -0.200685  0.300855
2013-01-03 -0.566954 -0.662751
2013-01-04  0.611497  1.120375
2013-01-05 -0.097501  0.116107
2013-01-06  0.469433 -0.935408

In [25]:
df.loc['20130101':'20130103', ['A', 'B']]

                   A         B
2013-01-01  1.604358  0.758764
2013-01-02 -0.200685  0.300855
2013-01-03 -0.566954 -0.662751

In [26]:
df.at[dates[0], 'A']

1.6043581916817362

In [27]:
df.iloc[3]

A    0.611497
B    1.120375
C    0.244885
D    0.821416
Name: 2013-01-04 00:00:00, dtype: float64

In [28]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.611497  1.120375
2013-01-05 -0.097501  0.116107

In [29]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.758764 -0.901469
2013-01-02  0.300855 -1.017939
2013-01-03 -0.662751  0.177715
2013-01-04  1.120375  0.244885
2013-01-05  0.116107  0.912280
2013-01-06 -0.935408  0.080791

In [30]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.200685  0.300855 -1.017939  0.260852
2013-01-03 -0.566954 -0.662751  0.177715 -1.611889

In [31]:
df.iloc[1, 1]

0.30085530044662112

In [33]:
df.iat[1, 1] # faster access

0.30085530044662112

### Boolean Indexing

In [34]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.604358  0.758764 -0.901469  0.804977
2013-01-04  0.611497  1.120375  0.244885  0.821416
2013-01-06  0.469433 -0.935408  0.080791  0.322760

In [35]:
df [df > 0]

                   A         B         C         D
2013-01-01  1.604358  0.758764       NaN  0.804977
2013-01-02       NaN  0.300855       NaN  0.260852
2013-01-03       NaN       NaN  0.177715       NaN
2013-01-04  0.611497  1.120375  0.244885  0.821416
2013-01-05       NaN  0.116107  0.912280       NaN
2013-01-06  0.469433       NaN  0.080791  0.322760

In [36]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  1.604358  0.758764 -0.901469  0.804977    one
2013-01-02 -0.200685  0.300855 -1.017939  0.260852    one
2013-01-03 -0.566954 -0.662751  0.177715 -1.611889    two
2013-01-04  0.611497  1.120375  0.244885  0.821416  three
2013-01-05 -0.097501  0.116107  0.912280 -0.721272   four
2013-01-06  0.469433 -0.935408  0.080791  0.322760  three

In [40]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.566954 -0.662751  0.177715 -1.611889   two
2013-01-05 -0.097501  0.116107  0.912280 -0.721272  four

In [44]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1
df['F'] = s1

In [45]:
df

                   A         B         C         D    F
2013-01-01  1.604358  0.758764 -0.901469  0.804977  NaN
2013-01-02 -0.200685  0.300855 -1.017939  0.260852  1.0
2013-01-03 -0.566954 -0.662751  0.177715 -1.611889  2.0
2013-01-04  0.611497  1.120375  0.244885  0.821416  3.0
2013-01-05 -0.097501  0.116107  0.912280 -0.721272  4.0
2013-01-06  0.469433 -0.935408  0.080791  0.322760  5.0

In [46]:
df.at[dates[0], 'A'] = 0

In [47]:
df.iat[0, 1] = 0

In [48]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.901469  0.804977  NaN
2013-01-02 -0.200685  0.300855 -1.017939  0.260852  1.0
2013-01-03 -0.566954 -0.662751  0.177715 -1.611889  2.0
2013-01-04  0.611497  1.120375  0.244885  0.821416  3.0
2013-01-05 -0.097501  0.116107  0.912280 -0.721272  4.0
2013-01-06  0.469433 -0.935408  0.080791  0.322760  5.0

In [49]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [50]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.901469  5  NaN
2013-01-02 -0.200685  0.300855 -1.017939  5  1.0
2013-01-03 -0.566954 -0.662751  0.177715  5  2.0
2013-01-04  0.611497  1.120375  0.244885  5  3.0
2013-01-05 -0.097501  0.116107  0.912280  5  4.0
2013-01-06  0.469433 -0.935408  0.080791  5  5.0

In [51]:
df2 = df.copy()
df2[df2 > 0] = -df2

In [52]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.901469 -5  NaN
2013-01-02 -0.200685 -0.300855 -1.017939 -5 -1.0
2013-01-03 -0.566954 -0.662751 -0.177715 -5 -2.0
2013-01-04 -0.611497 -1.120375 -0.244885 -5 -3.0
2013-01-05 -0.097501 -0.116107 -0.912280 -5 -4.0
2013-01-06 -0.469433 -0.935408 -0.080791 -5 -5.0

In [53]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]: dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.901469  5  NaN  1.0
2013-01-02 -0.200685  0.300855 -1.017939  5  1.0  1.0
2013-01-03 -0.566954 -0.662751  0.177715  5  2.0  NaN
2013-01-04  0.611497  1.120375  0.244885  5  3.0  NaN

In [54]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.200685  0.300855 -1.017939  5  1.0  1.0

In [55]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.901469  5  5.0  1.0
2013-01-02 -0.200685  0.300855 -1.017939  5  1.0  1.0
2013-01-03 -0.566954 -0.662751  0.177715  5  2.0  5.0
2013-01-04  0.611497  1.120375  0.244885  5  3.0  5.0

In [57]:
df.mean()

A    0.035965
B   -0.010137
C   -0.083956
D    5.000000
F    3.000000
dtype: float64

In [58]:
df.mean(1)

2013-01-01    1.024633
2013-01-02    1.016446
2013-01-03    1.189602
2013-01-04    1.995351
2013-01-05    1.986177
2013-01-06    1.922963
Freq: D, dtype: float64

In [62]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [63]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.566954 -1.662751 -0.822285  4.0  1.0
2013-01-04 -2.388503 -1.879625 -2.755115  2.0  0.0
2013-01-05 -5.097501 -4.883893 -4.087720  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [64]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.901469   5   NaN
2013-01-02 -0.200685  0.300855 -1.919408  10   1.0
2013-01-03 -0.767639 -0.361896 -1.741693  15   3.0
2013-01-04 -0.156141  0.758479 -1.496808  20   6.0
2013-01-05 -0.253642  0.874585 -0.584528  25  10.0
2013-01-06  0.215791 -0.060823 -0.503736  30  15.0

In [65]:
df.apply(lambda x : x.max() - x.min())

A    1.178451
B    2.055782
C    1.930219
D    0.000000
F    4.000000
dtype: float64

In [68]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    3
2    3
3    1
4    4
5    6
6    3
7    3
8    6
9    2
dtype: int64

In [70]:
s.value_counts()

3    4
6    3
4    1
2    1
1    1
dtype: int64

In [71]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat' ])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [73]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.587936 -1.331606 -0.435023 -0.143571
1  0.844003 -0.996831 -1.673809  0.045932
2  0.484871  0.296627 -2.260686 -0.840172
3  0.739156  0.922839  0.161984 -0.100907
4 -0.214172 -1.903742  0.136229  0.822527
5  0.614466 -0.735880 -0.550447  0.062002
6 -0.209606  1.065535 -0.593113 -0.145182
7 -2.038957 -1.508415 -0.725171  1.260828
8 -0.043493  1.350470  2.062796 -1.521761
9  0.764797  1.331423 -1.609467 -1.112583

In [75]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.587936 -1.331606 -0.435023 -0.143571
 1  0.844003 -0.996831 -1.673809  0.045932
 2  0.484871  0.296627 -2.260686 -0.840172,
           0         1         2         3
 3  0.739156  0.922839  0.161984 -0.100907
 4 -0.214172 -1.903742  0.136229  0.822527
 5  0.614466 -0.735880 -0.550447  0.062002
 6 -0.209606  1.065535 -0.593113 -0.145182,
           0         1         2         3
 7 -2.038957 -1.508415 -0.725171  1.260828
 8 -0.043493  1.350470  2.062796 -1.521761
 9  0.764797  1.331423 -1.609467 -1.112583]

In [76]:
pieces[0]

          0         1         2         3
0 -0.587936 -1.331606 -0.435023 -0.143571
1  0.844003 -0.996831 -1.673809  0.045932
2  0.484871  0.296627 -2.260686 -0.840172

In [77]:
pd.concat(pieces)

          0         1         2         3
0 -0.587936 -1.331606 -0.435023 -0.143571
1  0.844003 -0.996831 -1.673809  0.045932
2  0.484871  0.296627 -2.260686 -0.840172
3  0.739156  0.922839  0.161984 -0.100907
4 -0.214172 -1.903742  0.136229  0.822527
5  0.614466 -0.735880 -0.550447  0.062002
6 -0.209606  1.065535 -0.593113 -0.145182
7 -2.038957 -1.508415 -0.725171  1.260828
8 -0.043493  1.350470  2.062796 -1.521761
9  0.764797  1.331423 -1.609467 -1.112583